###############################################################
#  Generated by:      Cadence Innovus 16.21-s078_1
#  OS:                Linux x86_64(Host ID cad3)
#  Generated on:      Mon Jul 31 23:08:12 2017
#  Design:            core
#  Command:           saveDesign final.enc
###############################################################
current_design core
create_clock [get_ports {clk}]  -name clk -period 10.000000 -waveform {0.000000 5.000000}
set_propagated_clock  [get_ports {clk}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_data[15]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_data[22]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_data[8]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_data[29]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_data[6]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_data[11]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_data[25]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_data[18]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_data[4]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_data[2]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_data[0]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_data[27]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_data[21]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_data[14]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_data[16]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_data[23]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_data[9]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_data[30]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_data[10]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_data[7]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_data[12]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_data[5]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_data[26]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_data[19]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_data[3]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_data[1]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_data[28]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_data[22]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_data[15]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_data[17]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_data[24]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_data[31]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_data[11]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_data[8]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_data[13]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_data[20]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_data[27]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_data[6]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_data[4]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_data[30]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_data[23]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_data[16]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_data[2]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_data[29]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_data[0]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_data[18]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_data[25]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_data[12]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_data[9]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_data[14]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_data[21]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_data[7]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_data[28]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_data[5]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_data[10]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_data[3]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_data[31]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_data[24]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_data[17]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_data[1]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_data[19]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_data[26]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_data[20]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_data[13]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_addr[25]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_addr[18]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_addr[5]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {write_mem_data[13]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {write_mem_data[20]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {write_mem_data[5]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {write_mem_data[29]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_addr[1]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_addr[14]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_addr[21]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_addr[10]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_addr[26]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_addr[19]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_addr[6]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {write_mem_data[14]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {write_mem_data[21]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {write_mem_data[6]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_addr[2]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_addr[15]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_addr[22]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_addr[11]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_addr[27]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_addr[7]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {write_mem_data[15]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {write_mem_data[22]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {write_mem_data[7]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_addr[3]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_addr[16]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_addr[23]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_addr[30]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_addr[12]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_addr[28]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_addr[8]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {write_mem_data[16]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {write_mem_data[30]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {write_mem_data[23]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {write_mem_data[8]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_addr[4]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_addr[17]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_addr[24]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_addr[31]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_addr[20]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_addr[13]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_addr[0]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_addr[29]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {write_mem_data[0]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_addr[9]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {write_mem_data[17]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {write_mem_data[31]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {write_mem_data[24]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {write_mem_data[9]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_addr[5]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_addr[18]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_addr[25]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_addr[21]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_addr[14]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_addr[1]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {write_mem_data[1]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {write_mem_data[25]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {write_mem_data[18]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {write_enable}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_addr[10]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_addr[6]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_addr[19]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_addr[26]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_addr[22]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_addr[15]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_addr[2]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {write_mem_data[10]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {write_mem_data[2]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {write_mem_data[26]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {write_mem_data[19]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_addr[11]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_addr[7]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_addr[27]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_addr[30]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_addr[23]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_addr[16]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_addr[3]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {write_mem_data[11]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {write_mem_data[3]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {write_mem_data[27]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_addr[12]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_addr[8]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_addr[28]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_addr[31]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_addr[24]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_addr[17]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_addr[4]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {write_mem_data[12]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {write_mem_data[4]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {write_mem_data[28]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_addr[0]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_addr[13]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_addr[20]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {dmem_addr[9]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {imem_addr[29]}]
set_clock_uncertainty 0.02 [get_clocks {clk}]
